var data=[];

var dataStr='1、第一<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
2、第二<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
3、第三<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
4、第四<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
5、第五<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
6、第六<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
7、第七<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
8、第八<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
9、第九<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
10、第十<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
11、第十一<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
12、第十二<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
13、第十三<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
14、第十四<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
15、第十五<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
16、第十六<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
17、第十七<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
18、第十八<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
19、第十九<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
<br>\
<br>\
20、第二十<br>\
<br>\
导演:彼得-杰克逊<br>\
编剧:小张<br>\
主演:小红<br>\
类型: 小明<br>\
制片国家/地区:美国 / 冒险<br>\
语言:英语<br>\
上映日期:2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长:144分钟<br>\
';
var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
    var c = d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.png',
        caption:c[0].split('、')[1],
        desc:c[1]
    });

    // console.log(c[0].replace('、',' ')+'.png');
    //data[0] 数据格式已经构建成功
}